ASSIGNMENT: 23

1. List any five functions of the pandas library with execution.

read_csv(): This function is used to read a CSV file into a pandas dataframe.

In [2]:
import pandas as pd
df=pd.read_csv("StudentsPerformance.csv")
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

groupby(): This function is used to group data in a DataFrame based on one or more columns, and then apply a function to each group.

In [6]:
grouped = df.groupby('gender')['writing score'].mean()
grouped

gender
female    72.467181
male      63.311203
Name: writing score, dtype: float64



fillna(): This function is used to fill missing values in a DataFrame with a specified value or method

In [7]:
df.fillna(df.mean(), inplace=True)

/tmp/ipykernel_1208/1920348818.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.fillna(df.mean(), inplace=True)

pivot_table(): This function is used to create a pivot table from a DataFrame, which allows you to summarize and aggregate data across multiple dimensions

In [8]:
pivot = df.pivot_table(index='gender', columns='parental level of education', values='math score', aggfunc='mean')

In [9]:
print(pivot)

parental level of education  associate's degree  bachelor's degree  \
gender
female                                65.250000          68.349206
male                                  70.764151          70.581818

parental level of education  high school  master's degree  some college  \
gender
female                         59.351064        66.500000     65.406780
male                           64.705882        74.826087     69.009259

parental level of education  some high school
gender
female                              59.296703
male                                67.840909

describe(): This function is used to descirbe all the essential details about data.

In [10]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the 
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [11]:
import pandas as pd

def reindex_dataframe(df):
    new_index = range(1, len(df)*2, 2)
    df.index = new_index
    return df
df = pd.DataFrame({'A': [10, 20, 30], 'B': [40, 50, 60], 'C': [70, 80, 90]})

df = reindex_dataframe(df)

print(df)

    A   B   C
1  10  40  70
3  20  50  80
5  30  60  90

3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that 
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The 
function should print the sum to the console.

In [22]:
import pandas as pd

values = [10, 20, 30, 40, 50]
data = pd.DataFrame(values)

sum_first_three = data.iloc[:3].sum()
print(sum_first_three)

0    60
dtype: int64

4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 
'Word_Count' that contains the number of words in each row of the 'Text' column

In [12]:
import pandas as pd
import numpy as np

data = {'Text': ['This is a sample sentence.', 'Another sentence with more words.', 'Short sentence.']}
df = pd.DataFrame(data)

print(df)

                                Text
0         This is a sample sentence.
1  Another sentence with more words.
2                    Short sentence.

In [13]:
df['Word_Count'] = df['Text'].str.split().apply(len)

In [14]:
print(df)

                                Text  Word_Count
0         This is a sample sentence.           5
1  Another sentence with more words.           5
2                    Short sentence.           2

5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size() returns the total number of elements in the DataFrame, which is equal to the number of rows multiplied by the number of columns. It returns a single integer value.

In [17]:
df_size = df.size   # This will return the total number of elements in the DataFrame
df_size

6

DataFrame.shape() returns a tuple representing the dimensions of the DataFrame. The tuple contains two values: the number of rows and the number of columns.

In [19]:
df.shape

(3, 2)

6.  Which function of pandas do we use to read an excel file?

To read an Excel file into a pandas DataFrame, you can use the pandas.read_excel() function. This function allows you to read data from an Excel file into a pandas DataFrame object, which you can then manipulate using pandas.

7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email 
addresses in the format 'username@domain.com'. Write a Python function that creates a new column 
'Username' in df that contains only the username part of each email address.

In [1]:
import pandas as pd
import numpy as np

data2 = {'Email': ['rahul@gmail.com', 'ram@gmail.com', 'shiv@gmail.com']}
df = pd.DataFrame(data2)

In [2]:
df

             Email
0  rahul@gmail.com
1    ram@gmail.com
2   shiv@gmail.com

In [3]:
 df['Username'] = df['Email'].str.split('@').str[0]

In [4]:
df.head()

             Email Username
0  rahul@gmail.com    rahul
1    ram@gmail.com      ram
2   shiv@gmail.com     shiv

8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects 
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The 
function should return a new DataFrame that contains only the selected rows

In [5]:
import pandas as pd
import numpy as np

data3 = {'A': [2,5,3,6,7],'B':[37,34,2,30,7],'C':[12,43,5,2,9]}
df = pd.DataFrame(data3)

In [7]:
df.head()

   A   B   C
0  2  37  12
1  5  34  43
2  3   2   5
3  6  30   2
4  7   7   9

In [14]:
selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]

In [15]:
selected_rows

   A  B  C
4  7  7  9

9.  Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, 
median, and standard deviation of the values in the 'Values' column.

In [17]:
import pandas as pd
import numpy as np

data4 = {'values': [3,5,6,8,7,6,7,9]}
df=pd.DataFrame(data4)

In [18]:
df

   values
0       3
1       5
2       6
3       8
4       7
5       6
6       7
7       9

In [19]:
df.mean()

values    6.375
dtype: float64

In [20]:
df.median()

values    6.5
dtype: float64

In [21]:
df.std()

values    1.846812
dtype: float64

10.  Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to 
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days 
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and 
should include the current day.

In [25]:
import pandas as pd
import numpy as np

dates = pd.date_range(start='2022-01-01', end='2022-12-31')
sales = np.random.randint(100, size=len(dates))
df = pd.DataFrame({'Sales': sales, 'Date': dates})

In [26]:
df

     Sales       Date
0       25 2022-01-01
1       65 2022-01-02
2       12 2022-01-03
3       20 2022-01-04
4       79 2022-01-05
..     ...        ...
360     60 2022-12-27
361     83 2022-12-28
362     66 2022-12-29
363     58 2022-12-30
364     90 2022-12-31

[365 rows x 2 columns]

In [27]:
 df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()

In [28]:
df

     Sales       Date  MovingAverage
0       25 2022-01-01      25.000000
1       65 2022-01-02      45.000000
2       12 2022-01-03      34.000000
3       20 2022-01-04      30.500000
4       79 2022-01-05      40.200000
..     ...        ...            ...
360     60 2022-12-27      46.285714
361     83 2022-12-28      52.000000
362     66 2022-12-29      61.142857
363     58 2022-12-30      62.428571
364     90 2022-12-31      67.142857

[365 rows x 3 columns]

11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new 
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. 
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [29]:
import pandas as pd

dates = pd.date_range(start='2022-01-01', end='2022-01-07')
df = pd.DataFrame({'Date': dates})

print(df.head())

        Date
0 2022-01-01
1 2022-01-02
2 2022-01-03
3 2022-01-04
4 2022-01-05

In [30]:
df['Weekday'] = df['Date'].dt.day_name()
df

        Date    Weekday
0 2022-01-01   Saturday
1 2022-01-02     Sunday
2 2022-01-03     Monday
3 2022-01-04    Tuesday
4 2022-01-05  Wednesday
5 2022-01-06   Thursday
6 2022-01-07     Friday

12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python 
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [31]:
import pandas as pd

dates = pd.date_range(start='2023-01-01', end='2023-12-31', freq='H')
df = pd.DataFrame({'Date': dates})

print(df.head())

                 Date
0 2023-01-01 00:00:00
1 2023-01-01 01:00:00
2 2023-01-01 02:00:00
3 2023-01-01 03:00:00
4 2023-01-01 04:00:00

In [32]:
df.tail()

                    Date
8732 2023-12-30 20:00:00
8733 2023-12-30 21:00:00
8734 2023-12-30 22:00:00
8735 2023-12-30 23:00:00
8736 2023-12-31 00:00:00

In [36]:
selected_row = df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]

In [37]:
selected_row

                   Date
0   2023-01-01 00:00:00
1   2023-01-01 01:00:00
2   2023-01-01 02:00:00
3   2023-01-01 03:00:00
4   2023-01-01 04:00:00
..                  ...
716 2023-01-30 20:00:00
717 2023-01-30 21:00:00
718 2023-01-30 22:00:00
719 2023-01-30 23:00:00
720 2023-01-31 00:00:00

[721 rows x 1 columns]

13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to 
be imported?

The first and foremost necessary library that needs to be imported to use the basic functions of pandas is pandas itself.